src/Catalogs/ВидыНачисленийИУдержаний/ВидыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачисленийИУдержаний</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>Взносы в ПФР  с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Взносы в ПФР- накопительная часть(до 2014 года)</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Взносы в ПФР- страховая часть(до 2014 года)</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Взносы в ФСС (временная нетрудоспособность)</description>
    </items>
    <items>
      <name>ФССНесчастныеСлучаи</name>
      <description>Взносы в ФСС (несчастные случаи)</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Взносы в ФФОМС</description>
    </items>
    <items>
      <name>ВзносыПоЕдиномуТарифу</name>
      <description>Взносы по единому тарифу</description>
    </items>
    <items>
      <name>НалогНаДоходы</name>
      <description>Налог на доходы</description>
    </items>
    <items>
      <name>ПогашениеЗаймаИзЗарплаты</name>
      <description>Погашение займа из зарплаты</description>
    </items>
    <items>
      <name>ПремияЗаПродажи</name>
      <description>Премия за продажи</description>
    </items>
    <items>
      <name>ПроцентыПоЗайму</name>
      <description>Проценты по займу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>СдельнаяОплатаПроцент</name>
      <description>Сдельная оплата (процент)</description>
    </items>
    <items>
      <name>ФиксированнаяСумма</name>
      <description>Сдельная оплата (фиксированная сумма)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаПоСтраховымВзносам</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносамУНФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыНачисленийИУдержаний/Forms/ФормаСписка/Module.bsl
#Region СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Временное решение. Обход ошибки первоначального заполнения.
	Если Не Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы.Используется Тогда
		НалогНаДоходыОбъект = Справочники.ВидыНачисленийИУдержаний.НалогНаДоходы.ПолучитьОбъект();
		НалогНаДоходыОбъект.Используется = Истина;
		Попытка
			НалогНаДоходыОбъект.Записать();
		Исключение
			ТекстСообщенияОбОшибке = НСтр("ru = 'Не получилось изменить элемент налоги на доходы.'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(НалогНаДоходыОбъект, ТекстСообщенияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#EndRegion

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти
